## ISE 2023 Fall Moodle quiz 2

- Load the SQL module

In [3]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

- Connect to the PostgreSQL database:  
```python
%sql postgresql://username:password@server_address/database_name
```
  For most of you:  
  - server_address = localhost  
  - database_name = postgres

In [4]:
%sql postgresql://postgres:example@db:5432

- Run the following script:

In [5]:
%%sql
DROP SCHEMA IF EXISTS ise_quiz2_stocks CASCADE;
CREATE SCHEMA ise_quiz2_stocks;


CREATE TABLE ise_quiz2_stocks.aapl_s1_bid_a(
    time TIMESTAMP,
    open NUMERIC(7, 3),
    high NUMERIC(7, 3),
    low NUMERIC(7, 3),
    close NUMERIC(7, 3),
    volume FLOAT);

INSERT INTO ise_quiz2_stocks.aapl_s1_bid_a
    (time, open, high, low, close, volume) VALUES
    ('2017-10-23 14:30:00.000', 156.848, 156.848, 156.848, 156.848, 0.36),
    ('2017-10-23 14:30:01.000', 156.837, 156.837, 156.788, 156.788, 15.012),
    ('2017-10-23 14:30:02.000', 156.797, 156.797, 156.767, 156.787, 22.502),
    ('2017-10-23 14:30:03.000', 156.787, 156.787, 156.778, 156.778, 30),
    ('2017-10-23 14:30:04.000', 156.778, 156.778, 156.748, 156.748, 15),
    ('2017-10-23 14:30:05.000', 156.788, 156.788, 156.727, 156.788, 37.9),
    ('2017-10-23 14:30:06.000', 156.748, 156.748, 156.737, 156.737, 15),
    ('2017-10-23 14:30:07.000', 156.737, 156.737, 156.737, 156.737, 30),
    ('2017-10-23 14:30:08.000', 156.647, 156.647, 156.618, 156.627, 23.627),
    ('2017-10-23 14:30:09.000', 156.618, 156.618, 156.598, 156.598, 8.01);
    
CREATE TABLE ise_quiz2_stocks.aapl_s1_ask_a(
    time TIMESTAMP,
    open NUMERIC(7, 3),
    high NUMERIC(7, 3),
    low NUMERIC(7, 3),
    close NUMERIC(7, 3),
    volume FLOAT);

INSERT INTO ise_quiz2_stocks.aapl_s1_ask_a
    (time, open, high, low, close, volume) VALUES
    ('2017-10-23 14:30:00.000', 156.882, 156.882, 156.882, 156.882, 7.5),
    ('2017-10-23 14:30:01.000', 156.913, 156.913, 156.822, 156.822, 7.985),
    ('2017-10-23 14:30:02.000', 156.853, 156.853, 156.843, 156.843, 15.59),
    ('2017-10-23 14:30:03.000', 156.833, 156.833, 156.808, 156.833, 0.457),
    ('2017-10-23 14:30:04.000', 156.832, 156.832, 156.792, 156.792, 15),
    ('2017-10-23 14:30:05.000', 156.833, 156.833, 156.752, 156.822, 0.987),
    ('2017-10-23 14:30:06.000', 156.823, 156.823, 156.783, 156.783, 7.73),
    ('2017-10-23 14:30:07.000', 156.753, 156.783, 156.753, 156.783, 10.302),
    ('2017-10-23 14:30:08.000', 156.702, 156.703, 156.672, 156.702, 15.247),
    ('2017-10-23 14:30:09.000', 156.692, 156.692, 156.692, 156.692, 0.151);

CREATE TABLE ise_quiz2_stocks.aapl_s1_bid_b(
    time TIMESTAMP,
    open NUMERIC(7, 3),
    high NUMERIC(7, 3),
    low NUMERIC(7, 3),
    close NUMERIC(7, 3),
    volume FLOAT);

INSERT INTO ise_quiz2_stocks.aapl_s1_bid_b
    (time, open, high, low, close, volume) VALUES
    ('2017-10-23 14:30:05.000', 156.788, 156.788, 156.727, 156.788, 37.9),
    ('2017-10-23 14:30:06.000', 156.748, 156.748, 156.737, 156.737, 15),
    ('2017-10-23 14:30:07.000', 156.737, 156.737, 156.737, 156.737, 30),
    ('2017-10-23 14:30:08.000', 156.647, 156.647, 156.618, 156.627, 23.627),
    ('2017-10-23 14:30:09.000', 156.618, 156.618, 156.598, 156.598, 8.01),
    ('2017-10-23 14:30:10.000', 156.598, 156.627, 156.598, 156.608, 0.665),
    ('2017-10-23 14:30:11.000', 156.607, 156.607, 156.597, 156.597, 17.6),
    ('2017-10-23 14:30:12.000', 156.652, 156.657, 156.598, 156.598, 22.53),
    ('2017-10-23 14:30:13.000', 156.597, 156.597, 156.568, 156.568, 22.5),
    ('2017-10-23 14:30:14.000', 156.567, 156.567, 156.567, 156.567, 0.23);
    
CREATE TABLE ise_quiz2_stocks.goog_s1_bid_a(
    time TIMESTAMP,
    open NUMERIC(7, 3),
    high NUMERIC(7, 3),
    low NUMERIC(7, 3),
    close NUMERIC(7, 3),
    volume FLOAT);

INSERT INTO ise_quiz2_stocks.goog_s1_bid_a
    (time, open, high, low, close, volume) VALUES   
    ('2017-10-23 14:30:01.000', 1005.708, 1005.708, 1005.708, 1005.708, 15),
    ('2017-10-23 14:30:02.000', 1005.267, 1005.267, 1005.267, 1005.267, 0.019),
    ('2017-10-23 14:30:03.000', 1005.148, 1005.148, 1005.148, 1005.148, 22.5),
    ('2017-10-23 14:30:04.000', 1005.148, 1005.528, 1005.148, 1005.528, 30),
    ('2017-10-23 14:30:05.000', 1004.997, 1005.068, 1004.997, 1005.068, 0.042),
    ('2017-10-23 14:30:06.000', 1005.068, 1005.068, 1005.068, 1005.068, 0.001),
    ('2017-10-23 14:30:07.000', 1005.058, 1005.058, 1005.058, 1005.058, 10),
    ('2017-10-23 14:30:09.000', 1005.068, 1005.068, 1004.987, 1004.987, 7.501),
    ('2017-10-23 14:30:10.000', 1004.797, 1004.797, 1004.797, 1004.797, 10),
    ('2017-10-23 14:30:12.000', 1004.798, 1004.798, 1004.527, 1004.527, 7.501);
    
CREATE TABLE ise_quiz2_stocks.goog_s1_ask_a(
    time TIMESTAMP,
    open NUMERIC(7, 3),
    high NUMERIC(7, 3),
    low NUMERIC(7, 3),
    close NUMERIC(7, 3),
    volume FLOAT);

INSERT INTO ise_quiz2_stocks.goog_s1_ask_a
    (time, open, high, low, close, volume) VALUES 
    ('2017-10-23 14:30:01.000', 1005.723, 1005.732, 1005.723, 1005.732, 10.019),
    ('2017-10-23 14:30:02.000', 1005.622, 1005.622, 1005.622, 1005.622, 7.5),
    ('2017-10-23 14:30:03.000', 1005.622, 1005.622, 1005.412, 1005.622, 15.013),
    ('2017-10-23 14:30:04.000', 1005.262, 1005.992, 1005.262, 1005.853, 17.505),
    ('2017-10-23 14:30:05.000', 1005.853, 1005.993, 1005.802, 1005.802, 0.094),
    ('2017-10-23 14:30:06.000', 1005.422, 1005.422, 1005.422, 1005.422, 7.5),
    ('2017-10-23 14:30:07.000', 1005.802, 1005.802, 1005.802, 1005.802, 10.2),
    ('2017-10-23 14:30:09.000', 1005.273, 1005.273, 1005.233, 1005.233, 15),
    ('2017-10-23 14:30:10.000', 1005.463, 1005.463, 1005.463, 1005.463, 10.1),
    ('2017-10-23 14:30:12.000', 1005.462, 1005.462, 1005.062, 1005.062, 0.235);

 * postgresql://postgres:***@db:5432
Done.
Done.
Done.
10 rows affected.
Done.
10 rows affected.
Done.
10 rows affected.
Done.
10 rows affected.
Done.
10 rows affected.

[]

Summary of the schema:  
- 5 tables of stock-market data from NASDAQ, 23.10.2017, ~14:30 New York time
- Different tables for 'bid' and 'ask' prices. Ask is the price for which you can buy a stock (someone is willing to sell to you at this price), while bid is the price for which you can sell or short it (someone is willing to buy from you at this price).  
- The price of a stock is updated whenever a transaction (either buy or sell) occurs.
- Prices are given in aggregation ___candlesticks___ of 1 second. Open is the first price within the 1 second interval, while close is the last one. Accordingly, high and low are the maximum and minimum prices within the same time interval.
- Volume is the number of stocks (in thousands) that were traded (either bought or sold) within the 1 second interval.
- Missing data, e.g. Google's stock does not have data for 23.10.2017 14:30:08, are usually an indication that no transactions were completed during that interval.

For brevity, tables can be written without the schema name. However, you must include it in your SQL queries.  
For example:  
  $$ \text{aapl_s1_bid_a} \rightarrow \text{ise_quiz2_stocks.aapl_s1_bid_a} $$

For the following tasks, you will need to use the **extended projection** operator. This operator uses the same symbol as the normal projection, and allows you to create new attributes, by performing operations on the existing attributes of the relation. For example, assume that you have the following relation, with the name **numbers** and two attributes **Aa** and **Bb** :  

|Aa   |Bb   |
|---:|---:|
|   5|   3|
|   2|   1|
|   4|   7|  

If for example you wanted to create a new relation with the result of subtracting the numbers in column **Bb** from those in column **Aa** , then you would write this in relational algebra as:  

$$ \text{subtraction} = \pi_{(\text{Aa} - \text{Bb}) \rightarrow \text{result}}(\text{numbers}) $$

Executing this operation would result in the following **subtraction** table:  

|result|
|-----:|
|     2|
|     1|
|    -3|  

The __extended projection__ operator can be used together with the normal projection operation at the same time. Consider the following operation:  

$$ \text{subtraction} = \pi_{\text{Aa}, \text{Bb}, (\text{Aa} - \text{Bb}) \rightarrow \text{result}}(\text{numbers}) $$

The result is the following __subtraction__ table:  

|Aa   |Bb   |result|
|---:|---:|-----:|
|   5|   3|     2|
|   2|   1|     1|
|   4|   7|    -3|  


In SQL, the __extended projection__ operator works exactly the same way. The above operation can be written as (assuming the __numbers__ table has been already defined):  

```
SELECT Aa, Bb, (Aa - Bb) AS result
FROM numbers;
```

 For the following tasks, write the corresponding (a) relational algebra expression and (b) SQL query:  

__NOTE__ : The tables starting with "aapl" involve Apple's stock, while those starting with "goog" contain information on Google's stock.  

__NOTE__ :  For the moodle quiz, only the first relational algebra expression is required. For questions 2-5, the relation algebra expression is not needed for the moodle quiz, but it can be written down if it helps with the query.

__NOTE__ : You may write the relational algebra expression either at the appropriate cell using Markdown and Latex or in a separate document. Do not include the schema name in the table names. You are welcome to use shorter version for the table names, but make sure to make note of this appropriately, e.g.
$$ \text{Aba} = \text{aapl_s1_bid_a} \\
\text{Aaa} = \text{aapl_s1_ask_a} \\ 
\text{Gba} = \text{goog_s1_bid_a} \\
etc.
$$ 
Similarly, you can use aliases with the AS command for the SQL queries.

## Task 1
Which stock had the highest average 'ask' price during the given time period for Apple and Google stocks?
To answer this question, we need to calculate the average 'ask' price for each stock and then identify the stock with the highest average.

1a. Write in the following cell the relational algebra expression:

1b. Write in the following cell the SQL query:

In [130]:
%%sql

 * postgresql://postgres:***@db:5432
2 rows affected.

[('AAPL', Decimal('156.8116000000000000')),
 ('GOOG', Decimal('1005.5504000000000000'))]

## Task 2
What is the total volume of records where the 'bid' open price of AAPL stock exceed \\$150.75?

*Hint: We are looking for the sum of all the volumes, thus you must consider both `aapl_s1_bid_a` and `aapl_s1_bid_b` tables to answer*

2a. Write in the following cell the relational algebra expression:

2b. Write in the following cell the SQL query:

In [147]:
%%sql

 * postgresql://postgres:***@db:5432
6 rows affected.

[(datetime.datetime(2017, 10, 23, 14, 30, 4), Decimal('156.778'), Decimal('156.778'), Decimal('156.748'), Decimal('156.748'), 15.0),
 (datetime.datetime(2017, 10, 23, 14, 30, 5), Decimal('156.788'), Decimal('156.788'), Decimal('156.727'), Decimal('156.788'), 37.9),
 (datetime.datetime(2017, 10, 23, 14, 30, 3), Decimal('156.787'), Decimal('156.787'), Decimal('156.778'), Decimal('156.778'), 30.0),
 (datetime.datetime(2017, 10, 23, 14, 30, 1), Decimal('156.837'), Decimal('156.837'), Decimal('156.788'), Decimal('156.788'), 15.012),
 (datetime.datetime(2017, 10, 23, 14, 30), Decimal('156.848'), Decimal('156.848'), Decimal('156.848'), Decimal('156.848'), 0.36),
 (datetime.datetime(2017, 10, 23, 14, 30, 2), Decimal('156.797'), Decimal('156.797'), Decimal('156.767'), Decimal('156.787'), 22.502)]

## Task 3
Spread of a stock is defined as the difference between bid (table `aapl_s1_bid_a`) and ask (table `aapl_s1_ask_a`). 
Find the largest spread for apple by taking the difference between the `open` prices in the two tables.

*Hint: note that to combine both tables you must make sure they correspond to the same time*

3a. Write in the following cell the relational algebra expression:

3b. Write in the following cell the SQL query:

In [171]:
%%sql

 * postgresql://postgres:***@db:5432
1 rows affected.

[(Decimal('0.076'), datetime.datetime(2017, 10, 23, 14, 30, 1), Decimal('156.837'), Decimal('156.837'), Decimal('156.788'), Decimal('156.788'), 15.012, datetime.datetime(2017, 10, 23, 14, 30, 1), Decimal('156.913'), Decimal('156.913'), Decimal('156.822'), Decimal('156.822'), 7.985)]

## Task 4. 
Find the total value of transactions for (`aapl_s1_ask_a`) and Google (`goog_s1_ask_a`) 

Trade total value is defined as the `open` price times the volume, sumed over all records for that table

4a. Write in the following cell the relational algebra expression:

4b. Write in the following cell the SQL query:

In [172]:
%%sql

 * postgresql://postgres:***@db:5432
2 rows affected.

[('aapl', 12693.857509), ('goog', 93677.968585)]

## Task 5. 
Find the number of records for apple ask where the 
difference between highest and lowest ask price is smaller than the spread. 
*Hint: spread is the difference between ask `aapl_s1_bid_a` and bid `aapl_s1_ask` open price*

5a. Write in the following cell the relational algebra expression:

5b. Write in the following cell the SQL query:

In [ ]:
%%sql